const MapAreas = {
    name: "kaohsiungMapArea",
    areas: [
        {
            code: "R24",
            name: "R24 南岡山",
            coords: [279, 64, 279, 103, 294, 103, 294, 146, 340, 146, 340, 102, 364, 102, 364, 64],
            shape: "poly"
        },
        {
            code: "R23",
            name: "R23 橋頭火車站",
            coords: [277, 185, 383, 217],
            shape: "rect"
        },
        {
            code: "R22A",
            name: "R22A 橋頭糖廠",
            coords: [266, 233, 385, 265],
            shape: "rect"
        },
        {
            code: "R22",
            name: "R22 青埔",
            coords: [316, 275, 385, 308],
            shape: "rect"
        },
        {
            code: "R21",
            name: "R21 都會公園",
            coords: [284, 324, 385, 355],
            shape: "rect"
        },
        {
            code: "R20",
            name: "R20 後勁",
            coords: [316, 364, 385, 397],
            shape: "rect"
        },
        {
            code: "R19",
            name: "R19 楠梓加工區",
            coords: [239, 411, 385, 443],
            shape: "rect"
        },
        {
            code: "R18",
            name: "R18 油廠國小(中山大學附中)",
            coords: [234, 454, 384, 486],
            shape: "rect"
        },
        {
            code: "R17",
            name: "R17 世運(國家體育園區)",
            coords: [292, 499, 385, 530],
            shape: "rect"
        },
        {
            code: "R16",
            name: "R16 左營(高鐵)",
            coords: [311, 546, 385, 580],
            shape: "rect"
        },
        {
            code: "R15",
            name: "R15 生態園區",
            coords: [279, 607, 386, 638],
            shape: "rect"
        },
        {
            code: "R14",
            name: "R14 巨蛋(三民家商)",
            coords: [281, 653, 384, 690],
            shape: "rect"
        },
        {
            code: "R13",
            name: "R13 凹子底",
            coords: [302, 796, 301, 765, 332, 764, 333, 729, 399, 730, 399, 767, 356, 767, 355, 796],
            shape: "poly"
        },
        {
            code: "R12",
            name: "R12 後驛(高醫大)",
            coords: [308, 806, 390, 836],
            shape: "rect"
        },
        {
            code: "R11",
            name: "R11 高雄車站",
            coords: [285, 843, 388, 880],
            shape: "rect"
        },
        {
            code: "R10",
            name: "R10/O5 美麗島",
            coords: [335, 955, 335, 920, 276, 920, 276, 891, 355, 891, 355, 919, 401, 919, 401, 955],
            shape: "poly"
        },
        {
            code: "R9",
            name: "R9 中央公園",
            coords: [290, 994, 386, 1026],
            shape: "rect"
        },
        {
            code: "R8",
            name: "R8 三多商圈",
            coords: [255, 1056, 384, 1088],
            shape: "rect"
        },
        {
            code: "R7",
            name: "R7 獅甲(勞工公園)",
            coords: [328, 1165, 327, 1133, 398, 1134, 427, 1166],
            shape: "poly"
        },
        {
            code: "C3",
            name: "R6 C3 凱旋",
            coords: [399, 1226, 475, 1263],
            shape: "rect"
        },
        {
            code: "R5",
            name: "R5 前鎮高中(五甲)",
            coords: [532, 1275, 508, 1297, 529, 1320, 550, 1303, 677, 1303, 677, 1275],
            shape: "poly"
        },
        {
            code: "R4A",
            name: "R4A 草衙",
            coords: [589, 1313, 590, 1375, 630, 1374, 630, 1314],
            shape: "poly"
        },
        {
            code: "R4",
            name: "R4 高雄國際機場",
            coords: [692, 1345, 692, 1379, 662, 1379, 662, 1407, 780, 1407, 780, 1379, 720, 1379, 720, 1345],
            shape: "poly"
        },
        {
            code: "R3",
            name: "R3 小港",
            coords: [772, 1333, 862, 1377],
            shape: "rect"
        },
        {
            code: "O1",
            name: "O1 西子灣(中山大學)",
            coords: [38, 1006, 38, 1058, 120, 1058, 120, 1041, 134, 1041, 134, 1005],
            shape: "poly"
        },
        {
            code: "O2",
            name: "O2 鹽埕埔",
            coords: [193, 979, 193, 1012, 207, 1012, 207, 1039, 236, 1039, 236, 1012, 246, 1012, 246, 979],
            shape: "poly"
        },
        {
            code: "O4",
            name: "O4 市議會(舊址)",
            coords: [171, 935, 171, 965, 261, 965, 290, 976, 302, 950, 265, 935],
            shape: "poly"
        },
        {
            code: "O6",
            name: "O6 信義國小",
            coords: [483, 839, 504, 858, 450, 911, 451, 951, 420, 951, 419, 899],
            shape: "poly"
        },
        {
            code: "O7",
            name: "O7 文化中心",
            coords: [515, 858, 534, 878, 498, 914, 499, 953, 471, 952, 471, 901],
            shape: "poly"
        },
        {
            code: "O8",
            name: "O8 五塊厝",
            coords: [654, 860, 670, 878, 634, 914, 635, 953, 607, 952, 606, 909],
            shape: "poly"
        },
        {
            code: "O9",
            name: "O9 技擊館",
            coords: [717, 849, 736, 868, 694, 913, 695, 952, 667, 951, 665, 901],
            shape: "poly"
        },
        {
            code: "O10",
            name: "O10 衛武營",
            coords: [767, 858, 790, 881, 756, 915, 757, 953, 723, 952, 723, 901],
            shape: "poly"
        },
        {
            code: "O11",
            name: "O11 鳳山西站(高雄市議會)",
            coords: [880, 802, 904, 825, 819, 912, 820, 951, 787, 952, 788, 895],
            shape: "poly"
        },
        {
            code: "O12",
            name: "O12 鳳山",
            coords: [872, 876, 890, 896, 875, 913, 876, 952, 848, 951, 848, 900],
            shape: "poly"
        },
        {
            code: "O13",
            name: "O13 大東",
            coords: [933, 876, 955, 900, 940, 914, 942, 953, 908, 952, 908, 901],
            shape: "poly"
        },
        {
            code: "O14",
            name: "O14 鳳山國中",
            coords: [1041, 825, 1065, 851, 999, 917, 1000, 956, 972, 955, 971, 895],
            shape: "poly"
        },
        {
            code: "OT1",
            name: "OT1 大寮(前庄)",
            coords: [1033, 959, 1033, 999, 1034, 1004, 1034, 1030, 1084, 1029, 1083, 1002, 1083, 986, 1083, 958],
            shape: "poly"
        },
        {
            code: "C1",
            name: "C1 籬仔內",
            coords: [553, 1201, 522, 1170, 541, 1151, 561, 1172, 604, 1172, 604, 1201],
            shape: "poly"
        },
        {
            code: "C2",
            name: "C2 凱旋瑞田",
            coords: [523, 1225, 493, 1199, 511, 1181, 535, 1203, 596, 1202, 595, 1225],
            shape: "poly"
        },
        {
            code: "C3",
            name: "C3 前鎮之星",
            coords: [477, 1229, 571, 1261],
            shape: "rect"
        },
        {
            code: "C4",
            name: "C4 凱旋中華",
            coords: [436, 1330, 407, 1292, 432, 1266, 459, 1300, 507, 1300, 507, 1330],
            shape: "poly"
        },
        {
            code: "C5",
            name: "C5 夢時代",
            coords: [372, 1311, 372, 1338, 361, 1338, 361, 1367, 411, 1367, 411, 1338, 400, 1338, 400, 1311],
            shape: "poly"
        },
        {
            code: "C6",
            name: "C6 經貿園區",
            coords: [236, 1331, 236, 1304, 319, 1304, 344, 1279, 366, 1302, 336, 1331],
            shape: "poly"
        },
        {
            code: "C7",
            name: "C7 軟體園區",
            coords: [204, 1298, 204, 1271, 290, 1271, 315, 1246, 334, 1267, 304, 1298],
            shape: "poly"
        },
        {
            code: "C8",
            name: "C8 高雄展覽館",
            coords: [161, 1267, 161, 1240, 262, 1240, 286, 1216, 306, 1238, 276, 1267],
            shape: "poly"
        },
        {
            code: "C9",
            name: "C9 旅運中心",
            coords: [178, 1233, 178, 1206, 230, 1206, 254, 1182, 274, 1204, 244, 1233],
            shape: "poly"
        },
        {
            code: "C10",
            name: "C10 光榮碼頭",
            coords: [151, 1202, 151, 1175, 203, 1175, 227, 1151, 247, 1173, 217, 1202],
            shape: "poly"
        },
        {
            code: "C11",
            name: "C11 真愛碼頭",
            coords: [118, 1168, 118, 1141, 170, 1141, 194, 1117, 214, 1139, 184, 1168],
            shape: "poly"
        },
        {
            code: "C12",
            name: "C12 駁二大義",
            coords: [91, 1137, 91, 1110, 143, 1110, 167, 1086, 187, 1108, 157, 1137],
            shape: "poly"
        },
        {
            code: "C13",
            name: "C13 駁二蓬萊",
            coords: [60, 1103, 60, 1076, 112, 1076, 136, 1052, 156, 1074, 126, 1103],
            shape: "poly"
        },
        {
            code: "C14",
            name: "C14 哈瑪星",
            coords: [135, 1006, 166, 1006, 166, 1036, 200, 1036, 200, 1066, 150, 1066, 135, 1041],
            shape: "poly"
        },
        {
            code: "C15",
            name: "C15 壽山公園",
            coords: [34, 958, 151, 989],
            shape: "rect"
        },
        {
            code: "C16",
            name: "C16 文武聖殿",
            coords: [34, 922, 151, 952],
            shape: "rect"
        },
        {
            code: "C17",
            name: "C17 鼓山區公所",
            coords: [33, 885, 152, 917],
            shape: "rect"
        },
        {
            code: "C32",
            name: "C32 凱旋公園",
            coords: [548, 954, 642, 982],
            shape: "rect"
        },
        {
            code: "C33",
            name: "C33 衛生局",
            coords: [548, 990, 664, 1018],
            shape: "rect"
        },
        {
            code: "C34",
            name: "C34 五權國小",
            coords: [548, 1025, 685, 1055],
            shape: "rect"
        },
        {
            code: "C35",
            name: "C35 凱旋武昌",
            coords: [548, 1062, 665, 1092],
            shape: "rect"
        },
        {
            code: "C36",
            name: "C36 凱旋二聖",
            coords: [548, 1097, 665, 1127],
            shape: "rect"
        },
        {
            code: "C37",
            name: "C37 輕軌機廠",
            coords: [565, 1162, 542, 1145, 554, 1128, 579, 1136, 656, 1136, 656, 1163],
            shape: "poly"
        }
    ]
};


export default MapAreas;

